import React from 'react';
import MarkerItem from '../Marker';
import useSWR from 'swr';
import { MAP_KEY } from '../../hooks/useMap';
import { Store } from '../../types/store';
import useCurrentStore, {
  CURRENT_STORE_KEY,
} from '../..//hooks/useCurrentStore';
import { ImageIcon } from '../../types/map';
import { STORE_KEY } from '../../hooks/useStores';
// import MarderSVG from '../../public/assets/marker.svg'

const MarderSVG = `
<svg xmlns="http://www.w3.org/2000/svg" width="36" height="36" viewBox="0 0 36 36" fill="none">
<ellipse cx="18" cy="15" rx="12" ry="12" fill="white"/>
<path d="M18 32.4883L11.5048 22.3633L24.4952 22.3633L18 32.4883Z" fill="white"/>
<mask id="path-3-outside-1_350_10105" maskUnits="userSpaceOnUse" x="4" y="1" width="28" height="35" fill="black">
<rect fill="white" x="4" y="1" width="28" height="35"/>
<path fill-rule="evenodd" clip-rule="evenodd" d="M21.9471 26.3358C26.6355 24.7034 30 20.2446 30 15C30 8.37259 24.6274 3 18 3C11.3726 3 6 8.37259 6 15C6 20.2446 9.36453 24.7034 14.0529 26.3358L18 32.4887L21.9471 26.3358Z"/>
</mask>
<path fill-rule="evenodd" clip-rule="evenodd" d="M21.9471 26.3358C26.6355 24.7034 30 20.2446 30 15C30 8.37259 24.6274 3 18 3C11.3726 3 6 8.37259 6 15C6 20.2446 9.36453 24.7034 14.0529 26.3358L18 32.4887L21.9471 26.3358Z" fill="#8D6949"/>
<path d="M21.9471 26.3358L21.4539 24.9192L20.9644 25.0896L20.6845 25.5258L21.9471 26.3358ZM14.0529 26.3358L15.3155 25.5258L15.0356 25.0896L14.5461 24.9192L14.0529 26.3358ZM18 32.4887L16.7375 33.2986L18 35.2667L19.2625 33.2986L18 32.4887ZM28.5 15C28.5 19.5867 25.5582 23.4902 21.4539 24.9192L22.4403 27.7524C27.7128 25.9167 31.5 20.9026 31.5 15H28.5ZM18 4.5C23.799 4.5 28.5 9.20101 28.5 15H31.5C31.5 7.54416 25.4558 1.5 18 1.5V4.5ZM7.5 15C7.5 9.20101 12.201 4.5 18 4.5V1.5C10.5442 1.5 4.5 7.54416 4.5 15H7.5ZM14.5461 24.9192C10.4418 23.4902 7.5 19.5867 7.5 15H4.5C4.5 20.9026 8.28721 25.9167 13.5597 27.7524L14.5461 24.9192ZM19.2625 31.6787L15.3155 25.5258L12.7904 27.1457L16.7375 33.2986L19.2625 31.6787ZM20.6845 25.5258L16.7375 31.6787L19.2625 33.2986L23.2096 27.1457L20.6845 25.5258Z" fill="#2C2310" mask="url(#path-3-outside-1_350_10105)"/>
<circle cx="18" cy="15" r="4" fill="white"/>
</svg>
`;

const MarderSeletedSVG = `
<svg xmlns="http://www.w3.org/2000/svg" width="48" height="48" viewBox="0 0 48 48" fill="none">
<mask id="path-1-outside-1_397_2907" maskUnits="userSpaceOnUse" x="6" y="2" width="36" height="46" fill="black">
<rect fill="white" x="6" y="2" width="36" height="46"/>
<path fill-rule="evenodd" clip-rule="evenodd" d="M40 20C40 26.9929 35.514 32.9379 29.2628 35.1143L24 43.3182L18.7372 35.1143C12.486 32.9379 8 26.9929 8 20C8 11.1634 15.1634 4 24 4C32.8366 4 40 11.1634 40 20Z"/>
</mask>
<path fill-rule="evenodd" clip-rule="evenodd" d="M40 20C40 26.9929 35.514 32.9379 29.2628 35.1143L24 43.3182L18.7372 35.1143C12.486 32.9379 8 26.9929 8 20C8 11.1634 15.1634 4 24 4C32.8366 4 40 11.1634 40 20Z" fill="#5B4132"/>
<path d="M29.2628 35.1143L28.6052 33.2255L27.9525 33.4528L27.5794 34.0344L29.2628 35.1143ZM24 43.3182L22.3166 44.3981L24 47.0223L25.6834 44.3981L24 43.3182ZM18.7372 35.1143L20.4206 34.0344L20.0475 33.4528L19.3948 33.2255L18.7372 35.1143ZM29.9204 37.0031C36.9504 34.5556 42 27.8701 42 20H38C38 26.1156 34.0775 31.3203 28.6052 33.2255L29.9204 37.0031ZM25.6834 44.3981L30.9462 36.1942L27.5794 34.0344L22.3166 42.2383L25.6834 44.3981ZM17.0538 36.1942L22.3166 44.3981L25.6834 42.2383L20.4206 34.0344L17.0538 36.1942ZM6 20C6 27.8701 11.0496 34.5556 18.0796 37.0031L19.3948 33.2255C13.9225 31.3203 10 26.1156 10 20H6ZM24 2C14.0589 2 6 10.0589 6 20H10C10 12.268 16.268 6 24 6V2ZM42 20C42 10.0589 33.9411 2 24 2V6C31.732 6 38 12.268 38 20H42Z" fill="#2C2310" mask="url(#path-1-outside-1_397_2907)"/>
<path fill-rule="evenodd" clip-rule="evenodd" d="M19.157 25.5496L26.8382 13.0822C27.4948 12.0165 26.976 10.6828 25.6956 10.6606C23.0079 10.6142 19.3164 11.6779 16.6889 15.9426C14.0535 20.2202 14.9494 23.7238 16.3613 25.851C17.0311 26.8602 18.5066 26.6054 19.157 25.5496ZM28.0961 13.7232L20.4149 26.1906C19.7583 27.2562 20.2771 28.59 21.5575 28.6122C24.2452 28.6586 27.9367 27.5949 30.5642 23.3302C33.1996 19.0526 32.3037 15.549 30.8918 13.4218C30.222 12.4126 28.7465 12.6674 28.0961 13.7232Z" fill="white"/>
<path d="M26.8382 13.0822L26.9335 13.1408L26.8382 13.0822ZM19.157 25.5496L19.2523 25.6083L19.157 25.5496ZM25.6956 10.6606L25.6976 10.5488L25.6956 10.6606ZM16.6889 15.9426L16.5937 15.884L16.6889 15.9426ZM16.3613 25.851L16.4545 25.7891L16.3613 25.851ZM20.4149 26.1906L20.3196 26.1319L20.4149 26.1906ZM28.0961 13.7232L28.1913 13.7818L28.0961 13.7232ZM21.5575 28.6122L21.5556 28.724L21.5575 28.6122ZM30.5642 23.3302L30.469 23.2715L30.5642 23.3302ZM30.8918 13.4218L30.985 13.3599L30.8918 13.4218ZM26.743 13.0235L19.0618 25.491L19.2523 25.6083L26.9335 13.1408L26.743 13.0235ZM25.6937 10.7725C26.2904 10.7828 26.701 11.0958 26.891 11.5253C27.0825 11.9583 27.0536 12.5194 26.743 13.0235L26.9335 13.1408C27.2794 12.5793 27.3194 11.9407 27.0956 11.4348C26.8702 10.9255 26.3813 10.5606 25.6976 10.5488L25.6937 10.7725ZM16.7841 16.0013C19.3877 11.7755 23.0389 10.7266 25.6937 10.7725L25.6976 10.5488C22.9769 10.5017 19.2451 11.5803 16.5937 15.884L16.7841 16.0013ZM16.4545 25.7891C15.0641 23.6944 14.1739 20.238 16.7841 16.0013L16.5937 15.884C13.9331 20.2024 14.8346 23.7531 16.2681 25.9129L16.4545 25.7891ZM19.0618 25.491C18.754 25.9906 18.2519 26.2986 17.752 26.3637C17.2548 26.4285 16.7629 26.2537 16.4545 25.7891L16.2681 25.9129C16.6296 26.4575 17.2103 26.6599 17.7809 26.5856C18.3488 26.5116 18.9097 26.1644 19.2523 25.6083L19.0618 25.491ZM20.5101 26.2493L28.1913 13.7818L28.0008 13.6645L20.3196 26.1319L20.5101 26.2493ZM21.5594 28.5003C20.9627 28.49 20.5521 28.177 20.3621 27.7475C20.1706 27.3145 20.1996 26.7534 20.5101 26.2493L20.3196 26.1319C19.9737 26.6935 19.9338 27.3321 20.1575 27.838C20.3829 28.3473 20.8719 28.7122 21.5556 28.724L21.5594 28.5003ZM30.469 23.2715C27.8654 27.4973 24.2142 28.5462 21.5594 28.5003L21.5556 28.724C24.2762 28.771 28.008 27.6925 30.6594 23.3888L30.469 23.2715ZM30.7986 13.4837C32.189 15.5784 33.0792 19.0348 30.469 23.2715L30.6594 23.3888C33.32 19.0704 32.4185 15.5197 30.985 13.3599L30.7986 13.4837ZM28.1913 13.7818C28.4991 13.2822 29.0012 12.9742 29.5011 12.9091C29.9983 12.8443 30.4902 13.0191 30.7986 13.4837L30.985 13.3599C30.6235 12.8153 30.0428 12.6129 29.4722 12.6872C28.9043 12.7612 28.3434 13.1084 28.0008 13.6645L28.1913 13.7818Z" fill="white"/>
</svg>`;

interface Props {
  onClosedDetailModal: () => void;
}
const Markers = ({ onClosedDetailModal }: Props) => {
  const { data: stores } = useSWR<Store[]>(STORE_KEY);
  const { data: map } = useSWR(MAP_KEY);

  const { data: currentstore } = useSWR<Store>(CURRENT_STORE_KEY);
  const { setCurrentStore, cleartCurrentStore } = useCurrentStore();

  // const { data: current } = useSWR(CURRENT_STORE_KEY);
  // console.log('클릭한 매장 정보', current);

  console.log(stores);
  if (!map || !stores) return null;

  return (
    <div>
      {stores.map((store: any) => {
        return (
          <MarkerItem
            map={map}
            coordinates={[store.latitude, store.longitude]}
            icon={generateStoreMarkerIcon(false)}
            key={store.id}
            onClick={() => {
              setCurrentStore(store);
            }}
          />
        );
      })}
      {
        // 클릭된 store정보가 있는 경우 마커가 최상단에 위치할 수 있도록
        currentstore && (
          <MarkerItem
            map={map}
            coordinates={[currentstore.latitude, currentstore.longitude]}
            icon={generateStoreMarkerIcon(true)}
            key={currentstore.id}
            onClick={() => {
              onClosedDetailModal();
            }}
          />
        )
      }
    </div>
  );
};

export default Markers;

//marker icon으로 표시
export function generateStoreMarkerIcon(isSelected: boolean): ImageIcon {
  return {
    content: isSelected ? MarderSeletedSVG : MarderSVG, // SVG 아이콘을 포함한 문자열
    // anchor: new window.naver.maps.Point(16, 32), // SVG 아이콘의 중심점 설정
    // url: isSelected ? 'assets/marker-selected.png' : 'assets/marker.png',
    size: isSelected
      ? new naver.maps.Size(48, 48)
      : new naver.maps.Size(36, 36), //아이콘 크기
    origin: new naver.maps.Point(0, 0),
  };
}
